Tekla.Structures.Model.UI.ModelObjectSelector.FunctionalityEnum
Enumeration about what to do in TS size

Tekla.Structures.Model.UI.ModelObjectSelector.FunctionalityEnum.NEW_SELECTION
New selection

Tekla.Structures.Model.UI.ModelObjectSelector.FunctionalityEnum.ADD_TO_PREVIOUS_SELECTION
Add to previous

Tekla.Structures.Model.UI.ModelObjectSelector.FunctionalityEnum.SELECTION_FINISHED
Selection finished

Tekla.Structures.Model.UI.ModelObjectSelector.FunctionalityEnum.NEW_ANNOTATION_SELECTION
New annotation selection

Tekla.Structures.Model.UI.ModelObjectSelector.FunctionalityEnum.ADD_TO_PREVIOUS_ANNOTATION_SELECTION
Add to the previous annotation selection

Tekla.Structures.Model.UI.ModelObjectSelector.FunctionalityEnum.SELECTION_ANNOTATION_FINISHED
Annotation selections done